<!DOCTYPE html>
<html lang="en">
<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <link rel="stylesheet" href="style.css">
  <title>Document</title>
</head>
<body>
  
<!--<div id='task'>-->
<!---->
<!--</div>-->
<?php  

// $arr = [1, 3, 2, 2, 2, 2, 3, 3, 3, 10];


// function maxIntArray($a)
// {

// $arr = array_count_values($a);


// sort($arr);
// print_r($arr);
// $pop = array_key_last($arr);

// echo $pop;

// }

// maxIntArray($arr);



// $string1 = "school master";
// $string2 = "the classroom";

// function checkString($str1, $str2)
// {
//     $sum = 0;
//     if(strlen($str1) != strlen($str2)){
//         echo 'NO';
//         exit;
//     }

// for ($i=0; $i <strlen($str1) ; $i++) 
// { 
//     for ($j=0; $j < strlen($str2); $j++) { 
       
//         if ($str1[$i] == $str2[$j]) 
//         {
//             $sum++;
//             break;
//         }
           
//     }
// }

// if($sum == strlen($str1)){
//     echo 'YES';
// }else{
//     echo 'no';
// }

// }

// checkString($string1, $string2);



// $arr = [1, 2, 3, 4, 5];

// function evenInt($a){

//     for ($i=0; $i <= count($a)+1; $i++) { 
//         if ($a[$i] % 2 != 0 ) {
//             unset($a[$i]);
//         }
//     }
  
// print_r($a);
// }


// evenInt($arr);


// $str = 'dimadeveloper';

// function strRevers($str)
// {
//     for ($i=strlen($str); $i >= 0; $i--) { 
//         echo @($str[$i]);
//     }

// }
// strRevers($str);

// $array = [1, 3, 2, 2, 3, 0];
// $arr = [];

// function doubleInt(&$array, &$arr)
// {
//   for ($i = 0; $i <count($array); $i++) {
//       for ($j=$i; $j <$i + 1 ; $j++) { 

//         if($array[$i] == $array[$j]){
//             array_push($arr, $array[$i]);
//           }
//       }
     
//   }

// print_r($arr);
// }

// doubleInt($array, $arr);

// for ($i=0; $i < 6; $i++) { 
//   if ($i % 3 == 0) 
//     continue;
// echo $i % 3 . "<br>";
// }


// function myfunc(&$a){
//   $a++;return $a;
// }

// $b =5;
// $c = myfunc($b)+myfunc(2);
// echo $c;

// function byRefi(&$apples){
//   $apples++;
// }
// $oranges = 5;
// $apples = 5;
// byRefi($oranges);

// echo "У меня $apples яблок и $oranges апельсинв";

// function func($r){
//   $r++;
// }
// $r =1;
// func(func($r));
// echo $r;

?>

<!-- <div>
<button onclick = "alert('hello')">click</button>
</div> -->
<!-- <button onmouseover = "alert('hello')">over</button>-->

<!-- --------------------------------------------------------------------- -->

<!-- <button ondblclick= "alert('hello')">dblclick</button> -->

<!-- --------------------------------------------------------------------- -->

<!-- <button onmouseout= "alert('hello')">out</button>-->
<!-- --------------------------------------------------------------------- -->

<!-- <input type = 'text' id = 'text'>
<button onclick = "clickButton()">click me</button> -->
<!-- --------------------------------------------------------------------- -->

<!-- <input type = 'text' id = 'text'>
<button onclick = "changeInput()">нажимай</button> -->
<!-- --------------------------------------------------------------------- -->

<!-- <input type = 'text' onclick='inputChange(this)' onblur= 'inputChangeOut(this)' value = 'нажми'> -->
<!-- --------------------------------------------------------------------- -->

<!-- <input type='submit' onclick='changeTextSubmit(this)' value = 'нажми'> -->
<!-- --------------------------------------------------------------------- -->

<!-- <input type='submit' onclick='changeTextSubmit(this)' value = 'нажми'> -->
<!-- <input type = 'text' id='input' value='ку-ку'>
<button onclick="inputStyleChange()">нажми на меня</button> -->
<!-- --------------------------------------------------------------------- -->

<!-- <input type = 'text' id='input' value='ку-ку'>
<button onclick="inputStyleChange()">нажми на меня</button>
<button onclick="inputStyleChangeRevers()">нажми на меня ещё раз</button> -->
<!-- --------------------------------------------------------------------- -->

<!-- <input type = 'text' id='input' value='ку-ку'>
<button onclick="inputStyleChange()">нажми на меня</button> -->
<!-- --------------------------------------------------------------------- -->

<!-- <input type = 'submit' value = 'нажми на меня' onclick = 'sabmitStyleChange(this)' id ='Change'>
<input type = 'submit' value = 'нажми на меня для разблокировки' onclick = 'sabmitStyleChangeRevars(this)' id = 'ChangeRevers' style = "display:none"> -->
<!-- --------------------------------------------------------------------- -->

<!-- <input type = 'submit' onclick="inputCountsum(this)" value = '0'> -->
<!-- --------------------------------------------------------------------- -->

<!-- <input type='text' id = 'text1'  value = 'текст'>
<input type = 'text' id='text2' value='ку-ку'>
<button onclick="inpuTextChange()">нажми на меня</button> -->
<!-- --------------------------------------------------------------------- -->

<!-- <input type='text' id = 'int'  value = '0'>
<input type = 'text' id='square' value='0' disabled>
<button onclick="inpuIntSquare()">нажми на меня</button> -->
<!-- --------------------------------------------------------------------- -->

<!-- <input type = 'text' id = 'input' value = ''>
<button onclick="inpuElemAdd(this)" value = '+'>я добавлю +</button>
<button onclick="inpuElemAdd(this)" value = '-'>я добавлю -</button>
<button onclick="inpuElemAdd(this)" value = '*'>я добавлю *</button>
<button onclick="inpuElemAdd(this)" value = '/'>я добавлю /</button>
<button onclick="inpuElemAdd(this)" value = '1'>я добавлю 1</button>
<button onclick="inpuElemAdd(this)" value = '2'>я добавлю 2</button> -->
<!-- --------------------------------------------------------------------- -->

<!-- <p id = 'p'>привет</p>
<button onclick = 'textReplace()'>нажми для замены</button> -->
<!-- --------------------------------------------------------------------- -->

<!-- <input type = 'text' id = 'input1' value = ''>
+
<input type = 'text' id = 'input2' value = ''>
<p ><span>=</span> <span id = 'p'>?</span></p>
<button onclick = 'intSum()'>сложить</button> -->
<!-- --------------------------------------------------------------------- -->

<!-- <p>текcтс</p>
<p>текcтс</p>
<p>текcтс</p>
<p>текcтс</p>
<p>текcтс</p>
<h2>текcтс h2</h2>
<button onclick = 'textSquare()'>нажми</button> -->
<!-- --------------------------------------------------------------------- -->

<!-- <h2 class="www">Заголовок с классом www.</h2>
<p class="www">Абзац с классом www.</p>
<p class="www">Абзац с классом www.</p>
<p>Просто абзац, не поменяется.</p>
<button onclick=TextSquareClassName()>нажми</button> -->
<!-- --------------------------------------------------------------------- -->

<!-- <h2 class="www">Заголовок с классом www, не поменяется.</h2>
<p class="www">Абзац с классом www.</p>
<p class="www">Абзац с классом www.</p>
<p class="www">Абзац с классом www.</p>
<p>Просто абзац, не поменяется.</p>
<button onclick=TextSquarePClassName()>нажми</button> -->
<!-- --------------------------------------------------------------------- -->

<!-- <p class = 'myClass'>class = 'myClass'</p>
<button onclick = 'getAttr()'>нажми для вывода класса</button>
<button onclick = 'getAttrRemove()'>нажми для удаления класса</button>
<button onclick = 'setAttrReplacement()'>нажми для изменения класса</button> -->
<!-- --------------------------------------------------------------------- -->
<!--<input type='text' oninput="inpValue()" id = 'input' value = ''><span></span>-->
<!-- --------------------------------------------------------------------- -->

<!--<a href="http://google.ru">ссылка1</a>-->
<!--<br>-->
<!--<a href="http://tut.by">ссылка2</a>-->
<!--<br>-->
<!--<a href="http://yandex.ru">ссылка3</a>-->
<!--<br>-->
<!--<button onclick="viewLink()">нажми</button>-->
<!-- --------------------------------------------------------------------- -->
<!--<p id = 'p'>текст</p>-->
<!--<button onclick="disablButtonReplaceColorP(this)">нажми</button>-->
<!-- --------------------------------------------------------------------- -->

<!--<p class="www">Абзац с классом www.</p>-->
<!--<p class="www">Абзац с классом www.</p>-->
<!--<p class="www">Абзац с классом www.</p>-->
<!--<button onclick=TextReplaceP()>нажми</button>-->
<!-- --------------------------------------------------------------------- -->

<!--<p class="www">Абзац с классом www.</p>-->
<!--<p class="www">Абзац с классом www.</p>-->
<!--<p class="www">Абзац с классом www.</p>-->
<!--<button onclick=TextReplacePText()>нажми</button>-->
<!-- --------------------------------------------------------------------- -->
<!--<div>-->
<!--<input type="text" onmouseout="getDateBirth(this)" id="input" value="2014-01-12">-->
<!--</div>-->
<!--<div id="dateBirth"></div>-->
<!-- --------------------------------------------------------------------- -->
<!--Создайте отсчет с кнопкой остановки:-->
<!--<div id = 'count'><p id="p">0</p></div>-->
<!--<button id="but" disabled>остановить таймер</button>-->
<!--Создайте тикающие часики-->
<!--<div id ='time'></div>-->
<!-- --------------------------------------------------------------------- -->
<!--Создайте простой слайдер-->
<!--<div id="slider"><img src=""></div>-->
<!-- --------------------------------------------------------------------- -->
<!--карусель-->
<!--<div id="slider">-->
<!--    <img src="/images/1.png" id="img1">-->
<!--    <img src="/images/2.png" id="img2">-->
<!--    <img src="/images/3.png" id="img3">-->
<!--</div>-->
<!--<button id = 'button'>запустить карусель</button>-->
<!-- --------------------------------------------------------------------- -->

<!--<div id="wrapper">-->
<!--    <p>-->
<!--        До полуночи осталось:-->
<!--    </p>-->
<!--    <table border="1" cellpadding="0" cellspacing="0">-->
<!--        <tbody><tr>-->
<!--            <th>Часы</th>-->
<!--            <th>Минуты</th>-->
<!--            <th>Секунды</th>-->
<!--        </tr>-->
<!--        <tr>-->
<!--            <td id="hours"></td>-->
<!--            <td id="minutes"></td>-->
<!--            <td id="seconds"></td>-->
<!--        </tr>-->
<!--        </tbody></table>-->
<!--</div>-->

<!-- --------------------------------------------------------------------- -->

<!--Даны картинки. Привяжите к каждой картинке событие, чтобы по клику на картинку алертом выводился ее src.-->
<!--<div id="image">-->
<!--<img src="images/1.png" id="img1">-->
<!--<img src="images/2.png" id="img2">-->
<!--<img src="images/3.png" id="img3">-->
<!--</div>-->

<!-- --------------------------------------------------------------------- -->

<!--Даны ссылки. Привяжите всем ссылкам событие - по наведению на ссылку в атрибут title запишется ее текст-->
<!--Привяжите всем ссылкам событие - по наведению на ссылку в конец ее текста дописывается ее href в круглых скобках-->
<!--<a href="#123" title="" id="a1">первая ссылка</a>-->
<!--<br>-->
<!--<a href="#124" title="" id="a2">вторая ссылка</a>-->
<!--<br>-->
<!--<a href="#125" title="" id="a3">третья ссылка</a>-->

<!-- --------------------------------------------------------------------- -->
<!--Привяжите всем инпутам следующее событие - по потери фокуса каждый инпут выводит свое value в абзац с id="test".-->
<!--<input type="text" value="1">-->
<!--<input type="text" value="2">-->
<!--<input type="text" value="3">-->
<!--<p id="test"></p>-->

<!-- --------------------------------------------------------------------- -->
<!--Даны абзацы с числами. По нажатию на абзац в нем должен появится квадрат числа, которое он содержит-->
<!--<div id="intSquare">-->
<!--<p id="test1">1</p>-->
<!--<p id="test2">2</p>-->
<!--<p id="test3">3</p>-->
<!--<p id="test4">4</p>-->
<!--<p id="test5">5</p>-->
<!--</div>-->
<!-- --------------------------------------------------------------------- -->
<!--Даны инпуты. Сделайте так, чтобы все инпуты по потери фокуса проверяли свое содержимое на правильное количество символов. -->
<!--Сколько символов должно быть в инпуте, указывается в атрибуте data-length. -->
<!--Если вбито правильное количество, то граница инпута становится зеленой, если неправильное - красной.-->
<!--<input type="text" data-length = '3'>-->
<!--<br><br>-->
<!--<input type="text" data-length = '4'>-->
<!--<br><br>-->
<!--<input type="text" data-length = '5'>-->
<!--<br><br>-->
<!--<input type="text" data-length = '6'>-->
<!--<br><br>-->
<!--<input type="text" data-length = '7'>-->
<!-- --------------------------------------------------------------------- -->
<!--Даны дивы. По первому нажатию на каждый див он красится красным фоном, по второму красится обратно и так далее каждый -->
<!--клик происходит чередование фона. -->
<!--Сделайте так, чтобы было две функции: одна красит в красный цвет, другая в зеленый и они сменяли друг друга через removeEventListener-->
<!--<div style="width: 200px; height: 200px">asdasd</div>-->
<!--<div style="width: 200px; height: 200px">qwe21e</div>-->
<!-- --------------------------------------------------------------------- -->

<!--Дан элемент #elem. Добавьте ему класс www.-->
<!--Дан элемент #elem. Удалите у него класс www.-->
<!--Дан элемент #elem. Проверьте наличие у него класса www.-->
<!--Дан элемент #elem. Добавьте ему класс www, если его нет и удалите - если есть.-->
<!--Дан элемент #elem. Узнайте количество его классов.-->
<!--Дан элемент #elem. Выведите последовательно алертом его классы.-->
<!--<div class="aaa bbb ccc"></div>-->
<!-- --------------------------------------------------------------------- -->

<!--Дан элемент #elem. Сделайте его красного цвета, размером 30px, добавьте ему границу. Решите задачу с помощью свойства cssText.-->
<!--<div id="elem">asd</div>-->
<!-- --------------------------------------------------------------------- -->

<!--Дан элемент #elem. По клику на него выведите название его тега.-->
<!--Дан элемент #elem. По клику на него выведите название его тега в нижнем регистре.-->
<!--Даны элементы с классом www. Добавьте каждому элементу в конец название его тега в нижнем регистре.-->
<!--<div id="elem" class="www">нажми</div>-->
<!--<p class="www"></p>-->
<!-- --------------------------------------------------------------------- -->

<!-- Дан ol. Вставьте ему в конец li с текстом 'пункт'.-->
<!--<ol id="ol"></ol>-->
<!-- --------------------------------------------------------------------- -->

<!--Дан ul. Дан массив. Вставьте элементы этого массива в конец ul так, чтобы каждый элемент стоял в своем li.-->
<!--<ul id = "ul"></ul>-->
<!-- --------------------------------------------------------------------- -->

<!--Дан элемент ul, а в нем li #elem. Вставьте перед элементом #elem новую li с текстом '!!!'.-->
<!--Дан элемент #elem. Вставьте перед ним span с текстом '!!!'.-->
<!--Дан элемент #elem. Вставьте после него span с текстом '!!!'.-->
<!--Дан элемент #elem. Вставьте ему в начало span с текстом '!!!'.-->
<!--Дан элемент #elem. Вставьте ему в конец span с текстом '!!!'.-->
<!--<ul><li id="elem">123</li></ul>-->
<!--<ul id ="elem"></ul>-->
<!-- --------------------------------------------------------------------- -->

<!--Дан элемент #elem. Найдите первого потомка этого элемента и сделайте его текст красного цвета.-->
<!--Дан элемент #elem. Найдите последнего потомка этого элемента и сделайте его текст красного цвета.-->
<!--Дан элемент #elem. Найдите всех потомков этого элемента и добавьте им в конец текст '!'.-->
<!--<div id="elem">-->
<!--    <p>1</p>-->
<!--    <p>2</p>-->
<!--</div>-->
<!-- --------------------------------------------------------------------- -->
<!--Дан элемент #elem. Найдите его соседа сверху и добавьте ему в конец текст '!'.-->
<!--Дан элемент #elem. Найдите его соседа снизу и добавьте ему в конец текст '!'.-->
<!--Дан элемент #elem. Найдите его соседа снизу его соседа снизу (следующий элемент за соседним) и добавьте ему в конец текст '!'.-->
<!--<p>текст</p>-->
<!--<p id="elem"></p>-->
<!--<p>текст2</p>-->
<!--<p>текст3</p>-->
<!--<p>текст4</p>-->
<!--<p>текст5</p>-->
<!-- --------------------------------------------------------------------- -->

<!--Дан элемент #elem. Найдите его родителя и покрасьте его в красный цвет.-->
<!--Дан элемент #elem. Найдите родителя его родителя и покрасьте его в красный цвет.-->
<!--<div id="div" style="width: 60px; height: 60px">-->
<!--    <p id="elem"></p>-->
<!--</div>-->
<!-- --------------------------------------------------------------------- -->

<!--Дан элемент #parent, внутри него дан элемент #child. Дана кнопка. По нажатию на эту кнопку удалите элемент #child.-->
<!--Дан ol. По нажатию на кнопку получите его последнего потомка и удалите его.-->
<!--Дан элемент. Сделайте так, чтобы по нажатию по нему этот элемент удалялся.-->
<!--Дан ol, а внутри него li. Сделайте так, чтобы по нажатию на любую li эта li удалялась.-->
<!--<div id="parent">-->
<!--    <p id="child">123</p>-->
<!--    <button id="button">Нажми</button>-->
<!--</div>-->
<!--<ol>-->
<!--    <li>1</li>-->
<!--    <li>2</li>-->
<!--    <li>3</li>-->
<!--    <li>4</li>-->
<!--</ol>-->
<!--<p id ="elem">123</p>-->
<!--<ol id="ol">-->
<!--    <li>1</li>-->
<!--    <li>2</li>-->
<!--    <li>3</li>-->
<!--    <li>4</li>-->
<!--</ol>-->
<!-- --------------------------------------------------------------------- -->

<!-- Дан инпут. Дана кнопка. По нажатию на кнопку клонируйте этот инпут.-->
<!--<input type="text" id="input">-->
<!--<button id="button">but</button>-->
<!-- --------------------------------------------------------------------- -->

<!--Дан инпут. Рядом с ним находится кнопочка "+". По нажатию на эту кнопку под нашим инпутом должен появится еще один пустой инпут.-->
<!--<div style="width: 30px">-->
<!--<input type="text" id="input">-->
<!--</div>-->
<!--<button id="button">+</button>-->
<!-- --------------------------------------------------------------------- -->
<!--Дан инпут. В него вводится число. По потери фокуса сделайте так, чтобы каждая цифра вставилась в новый инпут. -->
<!--Инпутов для цифр изначально не существует, они должны создаться в процессе работы скрипта.-->
<!--<input type="text" id="input">-->
<!-- --------------------------------------------------------------------- -->

<!--Дана кнопка. Сделайте так, чтобы по нажатию на эту кнопку, скрывался родитель этой кнопки.-->

<!--<div style="background-color: red; width: 300px; height: 300px">-->
<!--    <button id="button">+</button>-->
<!--</div>-->
<!-- --------------------------------------------------------------------- -->


<!-- Даны кнопки. Привяжите к каждой кнопке событие по клику, которое будет 
считать количество нажатий по кнопке и выводить его в текст кнопки. Количество нажатий для каждой кнопки должно хранится в замыкании. -->
<!-- <button id="button1"> button1 </button>
<button id="button2"> button2 </button> -->
<!-- --------------------------------------------------------------------- -->


<!-- Дан массив цветов. Даны абзацы. По первому нажатию на абзац 
он должен покраситься в первый цвет из массива, по второму нажатию - во второй и так далее. Все абзацы работают независимо. -->
<!-- <p >1</p>
<p>2</p>
<p>3</p>
<p>4</p>
<p>5</p>
<p>6</p>
<p>7</p> -->
<!-- --------------------------------------------------------------------- -->


<!-- Даны инпуты. Сделайте так, чтобы каждый инпут хранил историю своих изменений. Каждый инпут свою. Изменением считается событие onchange. 
История должна хранится в замыкании. Над каждым инпутом должны быть стрелочки назад и вперед, с помощью которых можно передвигаться по истории. -->





<!-- Сделайте функцию, каждый вызов который будет генерировать случайные числа от 1 до 100, но так, 
чтобы они не повторялись, пока не будут перебраны все числа из этого промежутка. 
Решите задачу через замыкания - в замыкании должен хранится массив чисел, которые уже были сгенерированы функцией. -->
<button>click</button>
<p></p>






<script src="/app.js"></script>
</body>
</html>
   
   
   
   